package a311.college.enumeration.school;

public enum ArmyEnum {

    // 陆军（10所）
    陆军工程大学,
    陆军步兵学院,
    陆军装甲兵学院,
    陆军炮兵防空兵学院,
    陆军航空兵学院,
    陆军特种作战学院,
    陆军边海防学院,
    陆军防化学院,
    陆军军医大学,
    陆军军事交通学院,
    陆军勤务学院,

    // 海军（5所）
    海军工程大学,
    海军大连舰艇学院,
    海军潜艇学院,
    海军航空大学,
    海军军医大学,

    // 空军（4所）
    空军工程大学,
    空军航空大学,
    空军预警学院,
    空军军医大学,

    // 火箭军
    火箭军工程大学,

    // 战略支援部队（2所）
    航天工程大学,
    信息工程大学,

    // 武警部队（4所）
    武警工程大学,
    武警警官学院,
    武警特种警察学院,
    武警海警学院;
}
